# IsColumnInLoadSummary Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..IsColumnInLoadSummary Method
PanelScheduleView Class See Also
---
Check if this column in the load summary
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsColumnInLoadSummary(
	int nCol
)
```

Visual Basic
---
```text
Public Function IsColumnInLoadSummary ( _
	nCol As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsColumnInLoadSummary(
	int nCol
)
```

# ### Parameters
nCol
    Type: System..::..Int32 Column Number
# ### Return Value
Check if this column in the load summary
# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace